var earth = [{
"question":"Коя подред е Земята в Слънчевата система?",
"answers":["А. Втора.","Б. Седма.","В. Трета."],
"corect":"v"
},{
"question":"Кои са континентите на Земята?",
"answers":["А. Северна и Южна Америка, Европа, Азия, Африка, Австралия, Антарктида.","Б. Великобритания, Малта, Перу, Африка, Европа, Хаити, Азия.","В. Америка, Русия, Германия, Румъния, България."],
"corect":"a"
},{
"question":"Кой е най-големият естествен воден басейн от изброените?",
"answers":["А. Море.","Б. Язовир.","В. Океан."],
"corect":"v"
},{
"question":"Кои са климатичните пояси на Земята?",
"answers":["А. Екваториален, Субекваториален, Тропичен, Субтропичен, Умерен, Субполярен, Полярен.","Б. Екваториален, Субекваториален, Атлантичен, Субатлантичен, Антарктичен, Субантарктичен.","В. Еквадориален, Субеквадориален, Тропичен, Субумерен, Умерен, Субполярен, Антарктичен."],
"corect":"a"
},{
"question":"Каква е роля изпълнява Озоновия слой?",
"answers":["А. Предпазва от метеорити планетата.","Б. Поглъща ултравиолетовите лъчи.","В. Образува дъждовни облаци."],
"corect":"b"
}];
var arr = document.getElementsByTagName("li");
i = 0;
scores = 0;

function start(){
	document.getElementById("scores").innerHTML = "Точки: " + scores;
	if(i == 5){
		i = 0;
		alert("Край!");
	}
    arr[0].innerHTML = earth[i].question;
    arr[1].innerHTML = earth[i].answers[0];
    arr[2].innerHTML = earth[i].answers[1];
    arr[3].innerHTML = earth[i].answers[2];
	check = earth[i].corect;
	
}
function setQ(click){
	if(check == click){
		alert("Вярно!");
		scores += 1;
		i += 1;
		start();
	}
	else{
		alert("Грешно!");
		i += 1;
		start();
	}
}

start();
